Revit 2026 API

# WorksharingDisplaySettingsRestoreUsers Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int RestoreUsers(
	ICollection<string> usersToRestore
)
```
```vb
Public Function RestoreUsers (
	usersToRestore As ICollection(Of String)
) As Integer
```
```cpp
public:
int RestoreUsers(
	ICollection<String^>^ usersToRestore
)
```
```fsharp
member RestoreUsers :
        usersToRestore : ICollection<string> -> int
```

#### Parameters

usersToRestore ICollectionString

#### Return Value

Int32

#### Reference

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace